package com.example.studentportal.data.repository

import com.example.studentportal.data.model.Group

object GroupsRepository {
    val groupsList = listOf(
        Group("09.03.03", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.03.02", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.03.01", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.02.03", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.02.02", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.02.01", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.01.03", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.01.02", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.01.01", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.04.03", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.04.02", "23ВТ-09.03.03.пкк.кп_у"),
        Group("09.04.01", "23ВТ-09.03.03.пкк.кп_у")
    )
}