package com.example.studentportal.data.repository

import com.example.studentportal.data.model.Group

object GroupsRepository {
    val groupsList = listOf(
        Group("Группа 11", "24ВТ-27.03.03.01-о1"),
        Group("Группа 12", "24ВТ-27.03.05.01-o1"),
        Group("Группа 14", "24ВТ-12.03.01.01-o1"),
        Group("Группа 16", "24ВТ-09.03.03.01-o1"),
        Group("Группа 17", "24ВТ-09.03.03.01-o2"),
        Group("Группа 19", "24ВТ-09.03.03.01-o3"),
        Group("Группа 21", "23ВТ-27.03.03.01-o1"),
        Group("Группа 22", "23ВТ-27.03.05.01-o1"),
        Group("Группа 24", "23ВТ-12.03.01.01-o1"),
        Group("Группа 26", "23ВТ-09.03.03.01-o1"),
        Group("Группа 27", "23ВТ-09.03.03.01-o2"),
        Group("Группа 29", "23ВТ-09.03.03.01-o3"),
        Group("Группа 31", "22ВТ-27.03.03.01-o1"),
        Group("Группа 32", "22ВТ-27.03.05.01-o1"),
        Group("Группа 34", "22ВТ-12.03.01.01-o1"),
        Group("Группа 36", "22ВТ-09.03.03.01-o1"),
        Group("Группа 37", "22ВТ-09.03.03.01-o2"),
        Group("Группа 39", "22ВТ-09.03.03.01-o3"),
        Group("Группа 41", "21ВТ-27.03.03.01-o1"),
        Group("Группа 42", "21ВТ-27.03.05.01-o1"),
        Group("Группа 44", "21ВТ-12.03.01.01-o1"),
        Group("Группа 46", "21ВТ-09.03.03.01-o1"),
        Group("Группа 47", "21ВТ-09.03.03.01-o2"),
        Group("Группа 49", "21ВТ-09.03.03.01-o3")
    )
}