package com.example.studentportal.data.repository

import com.example.studentportal.data.model.Group

object GroupsRepository {
    val groupsList = listOf(
        Group("Группа 11", "24ВТ-27.03.03.01-о1",1),
        Group("Группа 12", "24ВТ-27.03.05.01-o1",2),
        Group("Группа 14", "24ВТ-12.03.01.01-o1",3),
        Group("Группа 16", "24ВТ-09.03.03.01-o1",4),
        Group("Группа 17", "24ВТ-09.03.03.01-o2",5),
        Group("Группа 19", "24ВТ-09.03.03.01-o3",6),
        Group("Группа 21", "23ВТ-27.03.03.01-o1",7),
        Group("Группа 22", "23ВТ-27.03.05.01-o1",8),
        Group("Группа 24", "23ВТ-12.03.01.01-o1",9),
        Group("Группа 26", "23ВТ-09.03.03.01-o1",10),
        Group("Группа 27", "23ВТ-09.03.03.01-o2",11),
        Group("Группа 29", "23ВТ-09.03.03.01-o3",12),
        Group("Группа 31", "22ВТ-27.03.03.01-o1",13),
        Group("Группа 32", "22ВТ-27.03.05.01-o1",14),
        Group("Группа 34", "22ВТ-12.03.01.01-o1",15),
        Group("Группа 36", "22ВТ-09.03.03.01-o1",16),
        Group("Группа 37", "22ВТ-09.03.03.01-o2",17),
        Group("Группа 39", "22ВТ-09.03.03.01-o3",18),
        Group("Группа 41", "21ВТ-27.03.03.01-o1",19),
        Group("Группа 42", "21ВТ-27.03.05.01-o1",20),
        Group("Группа 44", "21ВТ-12.03.01.01-o1",21),
        Group("Группа 46", "21ВТ-09.03.03.01-o1",22),
        Group("Группа 47", "21ВТ-09.03.03.01-o2",23),
        Group("Группа 49", "21ВТ-09.03.03.01-o3",24)
    )
}