package com.example.studentportal.data.repository

import Lesson
import java.util.Calendar

object LessonsRepository {
    val lessons = mutableListOf<Lesson>(
        //ГРУППА 2.9
        //Понедельник
        Lesson("1", "Практика", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),
        Lesson("2", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко Дмитрий Владимирович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),
        Lesson("3", "Лекция", "Технологии ООП", "4-я пара", "13:45-15:20", "514", "Яценко Дмитрий Владимирович", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),

        //Вторник
        Lesson("4", "Лекция", "ОФВТ", "2-я пара", "9:50-11:25", "514", "Толмачев Сергей Алексеевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "обе", "Группа 29"),

        //Среда
        Lesson("5", "Лабораторная", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),
        Lesson("6", "Лекция", "Технологии программирования", "2-я пара", "9:50-11:25", "514", "Губский Дмитрий Семенович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),
        Lesson("7", "Лабораторная", "Управление данными", "4-я пара", "13:45-15:20", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "2", "Группа 29"),
        Lesson("8", "Лабораторная", "Технологии программирования", "5-я пара", "15:20-17:25", "609", "Губский Дмитрий Семенович; Иванова Ирина Николаевна",
            "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),

        //Четверг
        Lesson("9", "Лабораторная", "Технологии ООП", "3-я пара", "11:55-13:30", "609a", "Батычко Николай Николаевич", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 29"),
        Lesson("10", "Лабораторная", "Управление данными", "4-я пара", "13:45-15:20", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "1", "Группа 29"),

        //Пятница
        Lesson("11", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "Экзамен",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 29"),

        //Суббота
        Lesson("12", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "Зачет",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 29"),

        //ГРУППА 2.7
        //Понедельник
        Lesson("13", "Практика", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 27"),
        Lesson("14", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко Дмитрий Владимирович", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 27"),
        Lesson("15", "Лекция", "Технологии ООП", "4-я пара", "13:45-15:20", "514", "Яценко Дмитрий Владимирович", "Зачет",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 27"),

        //Вторник
        Lesson("16", "Лекция", "ОФВТ", "2-я пара", "9:50-11:25", "514", "Толмачев Сергей Алексеевич", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "обе", "Группа 27"),

        //Среда
        Lesson("17", "Лекция", "Технологии программирования", "2-я пара", "9:50-11:25", "514", "Губский Дмитрий Семенович", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 27"),
        Lesson("18", "Лабораторная", "Технологии программирования", "4-я пара", "13:45-15:20", "609", "Губский Дмитрий Семенович; Иванова Ирина Николаевна",
            "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 27"),

        //Четверг
        Lesson("19", "Лабораторная", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 27"),
        Lesson("20", "Лабораторная", "Технологии ООП", "2-я пара", "9:50-11:25", "612", "Батычко Николай Николаевич", "Зачет",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 27"),
        Lesson("21", "Лабораторная", "Управление данными", "3-я пара", "11:55-13:30", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
        "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 27"),

        //Пятница
        Lesson("22", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "Экзамен",
        "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 27"),

        //Суббота
        Lesson("23", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "Зачет",
        "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 27"),

        //ГРУППА 2.6
        //Понедельник
        Lesson("24", "Практика", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 26"),
        Lesson("25", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко Дмитрий Владимирович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 26"),
        Lesson("26", "Лекция", "Технологии ООП", "4-я пара", "13:45-15:20", "514", "Яценко Дмитрий Владимирович", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 26"),

        //Вторник
        Lesson("27", "Лабораторная", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 26"),
        Lesson("28", "Лекция", "ОФВТ", "2-я пара", "9:50-11:25", "514", "Толмачев Сергей Алексеевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "обе", "Группа 26"),
        Lesson("29", "Лабораторная", "Управление данными", "3-я пара", "11:55-13:30", "609", "Батычко Николай Николаевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "2", "Группа 26"),

        //Среда
        Lesson("30", "Лекция", "Технологии программирования", "2-я пара", "9:50-11:25", "514", "Губский Дмитрий Семенович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 26"),
        Lesson("31", "Лабораторная", "Технологии программирования", "3-я пара", "11:55-13:30", "609", "Губский Дмитрий Семенович; Иванова Ирина Николаевна",
            "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 26"),

        //Четверг
        Lesson("32", "Лабораторная", "Технологии ООП", "4-я пара", "13:45-15:20", "609a", "Батычко Николай Николаевич", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 26"),
        Lesson("33", "Лабораторная", "Управление данными", "5-я пара", "15:50-17:25", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "1", "Группа 26"),

        //Пятница
        Lesson("34", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "Экзамен",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 26"),

        //Суббота
        Lesson("35", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "Зачет",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 26"),

        //ГРУППА 2.1
        //Понедельник
        Lesson("36", "Лабораторная", "Основы теории управления", "1-я пара", "8:00-9:35", "606", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "верхняя", "1", "Группа 21"),
        Lesson("37", "Лабораторная", "Основы теории управления", "1-я пара", "8:00-9:35", "606", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "нижняя", "2", "Группа 21"),
        Lesson("38", "Лекция", "Основы теории управления", "2-я пара", "9:50-11:25", "711", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 21"),
        Lesson("39", "Практика", "Основы теории управления", "4-я пара", "13:45-15:20", "502", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "верхняя", "обе", "Группа 21"),

        //Вторник
        Lesson("40", "Лабораторная", "Объектно-ориентированное программирование", "2-я пара", "9:50-11:25", "609", "Шабаршина Ирина Сергеевна",
            "-", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "2", "Группа 21"),
        Lesson("41", "Лекция", "Объектно-ориентированное программирование", "3-я пара", "11:55-13:30", "510", "Шабаршина Ирина Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "верхняя", "обе", "Группа 21"),
        Lesson("42", "Лабораторная", "Объектно-ориентированное программирование", "4-я пара", "13:45-15:20", "609", "Шабаршина Ирина Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "1", "Группа 21"),

        //Среда
        Lesson("43", "Лабораторная", "Системный анализ и принятие решений", "2-я пара", "9:50-11:25", "606", "Чусова Юлия Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "верхняя", "1", "Группа 21"),
        Lesson("44", "Лабораторная", "Системный анализ и принятие решений", "2-я пара", "9:50-11:25", "606а", "Чусова Юлия Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "нижняя", "2", "Группа 21"),
        Lesson("45", "Лекция", "Системный анализ и принятие решений", "3-я пара", "11:55-13:30", "503", "Чусова Юлия Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 21"),
        Lesson("46", "Практика", "Системный анализ и принятие решений", "4-я пара", "13:45-15:20", "503", "Чусова Юлия Сергеевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 21"),

        //Пятница
        Lesson("47", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "-",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 21"),

        //Суббота
        Lesson("48", "Лекция", "Анализ проблем и принятие решений", "1-я пара", "8:00-9:35", "MS Teams", "Ермишина Анна Вениаминовна", "-",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 21"),
        Lesson("49", "Практика", "Анализ проблем и принятие решений", "2-я пара", "9:50-11:25", "MS Teams", "Ширяев Игорь Михайлович", "-",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 21"),

        //ГРУППА 2.2
        //Понедельник
        Lesson("50", "Лекция", "Основы теории управления", "2-я пара", "9:50-11:25", "711", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 22"),
        Lesson("51", "Практика", "Основы теории управления", "3-я пара", "11:55-13:30", "503", "Кузнецова Алла Витальевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 22"),
        Lesson("52", "Лекция", "Технологии ООП", "4-я пара", "13:45-15:20", "514", "Яценко Дмитрий Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 22"),

        //Вторник
        Lesson("53", "Лекция", "Механика и технологии", "3-я пара", "11:55-13:30", "507", "Бычков Андрей Александрович",
            "-", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "верхняя", "обе", "Группа 22"),
        Lesson("54", "Практика", "Механика и технологии", "3-я пара", "11:55-13:30", "507", "Бычков Андрей Александрович",
            "-", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "нижняя", "обе", "Группа 22"),
        Lesson("55", "Лабораторная", "Технологии ООП", "4-я пара", "13:45-15:20", "608", "Батычко Николай Николаевич", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "обе", "Группа 22"),

        //Среда
        Lesson("56", "Лекция", "Управление инновационной деятельностью", "1-я пара", "8:00-9:35", "514", "Гусенко Тамара Григорьевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 22"),
        Lesson("57", "Лекция", "Технология компьютерного моделирования", "2-я пара", "9:50-11:25", "502", "Олишевский Даниил Петрович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "верхняя", "обе", "Группа 22"),
        Lesson("58", "Практика", "Технология компьютерного моделирования", "2-я пара", "9:50-11:25", "502", "Олишевский Даниил Петрович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "нижняя", "обе", "Группа 22"),
        Lesson("59", "Практика", "Управление инновационной деятельностью", "3-я пара", "11:55-13:30", "502", "Гусенко Тамара Григорьевна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 22"),

        //Пятница
        Lesson("60", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "-",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 22"),

        //Суббота
        Lesson("61", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "-",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 22"),

        //ГРУППА 2.4
        //Понедельник
        Lesson("62", "Лабораторная", "Теория и технология программирования", "2-я пара", "9:50-11:25", "608", "Жукова Татьяна Павловна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "1", "Группа 24"),
        Lesson("63", "Лабораторная", "Приборы и методы контроля и диагностики", "2-я пара", "9:50-11:25", "709", "Мараховский Михаил Алексеевич", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "2", "Группа 24"),
        Lesson("64", "Лекция", "Химия и материаловедение", "3-я пара", "11:55-13:30", "502", "Дыкина Любовь Александровна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 24"),
        Lesson("65", "Лабораторная", "Химия и материаловедение", "4-я пара", "13:45-15:20", "103", "Нагаенко Александр Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "2", "Группа 24"),

        //Вторник
        Lesson("66", "Лабораторная", "Химия и материаловедение", "2-я пара", "9:50-11:25", "103", "Нагаенко Александр Владимирович",
            "-", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "1", "Группа 24"),
        Lesson("67", "Лабораторная", "Теория и технология программирования", "2-я пара", "9:50-11:25", "608", "Жукова Татьяна Павловна",
            "-", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "2", "Группа 24"),
        Lesson("68", "Лекция", "Проект на 2 курсе", "3-я пара", "11:55-13:30", "511", "Жукова Татьяна Павловна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "верхняя", "обе", "Группа 24"),
        Lesson("69", "Практика", "Теория и технология программирования", "3-я пара", "11:55-13:30", "511", "Жукова Татьяна Павловна", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "нижняя", "обе", "Группа 24"),
        Lesson("70", "Лабораторная", "Физические основы получения информации", "4-я пара", "13:45-15:20", "709", "Нагаенко Александр Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "верхняя", "1", "Группа 24"),
        Lesson("71", "Лабораторная", "Физические основы получения информации", "4-я пара", "13:45-15:20", "709", "Нагаенко Александр Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "нижняя", "2", "Группа 24"),

        //Среда
        Lesson("72", "Лекция", "Физические основы получения информации", "2-я пара", "9:50-11:25", "507", "Нагаенко Александр Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "верхняя", "обе", "Группа 24"),
        Lesson("73", "Практика", "Физические основы получения информации", "2-я пара", "9:50-11:25", "507", "Нагаенко Александр Владимирович", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "нижняя", "обе", "Группа 24"),
        Lesson("74", "Лекция", "Приборы и методы контроля диагностики", "3-я пара", "11:55-13:30", "507", "Мараховский Михаил Алексеевич", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "верхняя", "обе", "Группа 24"),
        Lesson("75", "Практика", "Приборы и методы контроля диагностики", "3-я пара", "11:55-13:30", "507", "Мараховский Михаил Алексеевич", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "нижняя", "обе", "Группа 24"),
        Lesson("76", "Лабораторная", "Приборы и методы контроля диагностики", "4-я пара", "13:45-15:20", "709", "Мараховский Михаил Алексеевич", "-",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "1", "Группа 24"),

        //Пятница
        Lesson("77", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "-",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 24"),

        //Суббота
        Lesson("78", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "-",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 24"),
    )

    fun getRelevantLessons(group: String, currentWeekType: String): List<Lesson> {
        return lessons.filter { lesson ->
            lesson.group == group &&
                    (lesson.weekType == currentWeekType || lesson.weekType == "обе")
        }
    }

    fun getTodaysLessons(group: String, currentWeekType: String): List<Lesson> {
        val today = Calendar.getInstance().get(Calendar.DAY_OF_WEEK)
        return getRelevantLessons(group, currentWeekType)
            .filter { it.dayOfWeek == today }
            .sortedBy { it.getStartTime() }
    }
}