package com.example.studentportal.data.repository

import com.example.studentportal.data.model.Lesson
import java.util.Calendar

object LessonsRepository {
    val lessons = mutableListOf<Lesson>(
        Lesson("1", "Лекция", "Управление данными", "1-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        Lesson("7", "Лекция", "Управление данными", "2-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        Lesson("8", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        Lesson("9", "Лекция", "Управление данными", "4-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        Lesson("6", "Лекция", "ООП", "5-я пара", "13:45-15:20", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "нижняя"),
        Lesson("2", "Семинар", "Математика", "2-я пара", "11:55-13:25", "405", "Дядя Боря", "Экзамен", "МехМат", "ул. Какая-то, д. 30", Calendar.TUESDAY, "верхняя"),
        Lesson("3", "Семинар", "Философия", "3-я пара", "13:45-15:20", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе"),
        Lesson("4", "Семинар", "Философия", "4-я пара", "15:50-17:25", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе"),
        Lesson("5", "Семинар", "Философия", "4-я пара", "15:50-17:25", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.FRIDAY, "обе")
    )
}