package com.example.studentportal.data.repository

import Lesson
import java.util.Calendar

object LessonsRepository {
    val lessons = mutableListOf<Lesson>(
        Lesson("1", "Практика", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),
        Lesson("2", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко Дмитрий Владимирович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),
        Lesson("3", "Лекция", "Технологии ООП", "4-я пара", "13:45-15:20", "514", "Яценко", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе", "обе", "Группа 29"),

        Lesson("4", "Лекция", "ОФВТ", "2-я пара", "9:50-11:25", "514", "Толмачев Сергей Алексеевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.TUESDAY, "обе", "обе", "Группа 29"),

        Lesson("5", "Лабораторная", "ОФВТ", "1-я пара", "8:00-9:35", "709", "Соколов Михаил Вячеславович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),
        Lesson("6", "Лекция", "Технологии программирования", "2-я пара", "9:50-11:25", "514", "Губский Дмитрий Семенович", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),
        Lesson("7", "Лабораторная", "Управление данными", "4-я пара", "13:45-15:20", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "2", "Группа 29"),
        Lesson("8", "Лабораторная", "Технологии программирования", "5-я пара", "15:20-17:25", "609", "Губский Дмитрий Семенович; Иванова Ирина Николаевна",
            "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе", "обе", "Группа 29"),

        Lesson("9", "Лабораторная", "Технологии ООП", "3-я пара", "11:55-13:30", "609a", "Батычко Николай Николаевич", "Зачет",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "обе", "Группа 29"),
        Lesson("10", "Лабораторная", "Управление данными", "4-я пара", "13:45-15:20", "612", "Чернышев Юрий Геннадьевич", "Экзамен",
            "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе", "1", "Группа 29"),

        Lesson("11", "Практика", "Английский язык", "1-я пара", "8:00-9:35", "-", "-", "Экзамен",
            "-", "-", Calendar.FRIDAY, "обе", "обе", "Группа 29"),

        Lesson("12", "Практика", "МУАМ", "1-я пара", "8:00-9:35", "-", "-", "Зачет",
            "-", "-", Calendar.SATURDAY, "обе", "обе", "Группа 29")
    )
}