package com.example.studentportal.data

import java.util.Calendar

object dataLessons {
    val lessons = mutableListOf<lesson>(
        lesson("1", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        lesson("7", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        lesson("8", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        lesson("9", "Лекция", "Управление данными", "3-я пара", "11:55-13:30", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "обе"),
        lesson("6", "Лекция", "ООП", "4-я пара", "13:45-15:20", "514", "Яценко", "Экзамен", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.MONDAY, "нижняя"),
        lesson("2", "Семинар", "Математика", "2-я пара", "11:55-13:25", "405", "Дядя Боря", "Экзамен", "МехМат", "ул. Какая-то, д. 30", Calendar.TUESDAY, "верхняя"),
        lesson("3", "Семинар", "Философия", "3-я пара", "13:45-15:20", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.WEDNESDAY, "обе"),
        lesson("4", "Семинар", "Философия", "4-я пара", "15:50-17:25", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.THURSDAY, "обе"),
        lesson("5", "Семинар", "Философия", "4-я пара", "15:50-17:25", "405", "Новохатько Александр Григорьевич", "Дифф. зачет", "ИВТиПТ", "ул. Мильчакова, д. 10", Calendar.FRIDAY, "обе")
    )
}